artillery.yml
# Combined Artillery test: aggressive (HTTP+WS) and 100k WS users in one file
#
# Use environments to pick the test:
#   Aggressive: npx artillery@latest run -e aggressive artillery.yml
#   100k users: npx artillery@latest run -e hundredk artillery.yml
#
# With report:
#   npx artillery@latest run -e aggressive artillery.yml -o aggressive.json && npx artillery@latest report aggressive.json
#   npx artillery@latest run -e hundredk artillery.yml -o hundredk.json && npx artillery@latest report hundredk.json

config:
  target: "https://localhost:8443"
  tls:
    rejectUnauthorized: false
  defaults:
    headers:
      User-Agent: "artillery-e2e-load"
  variables:
    ws_url: "wss://localhost:8443/"

  environments:
    aggressive:
      phases:
        - duration: 30
          arrivalRate: 20
          name: warmup
        - duration: 120
          arrivalRate: 100
          rampTo: 400
          name: ramp-up
        - duration: 180
          arrivalRate: 400
          name: sustain
      # Bias scenario selection for aggressive mix
      scenarios:
        - name: HTTP health flood
          weight: 40
        - name: WS debug-status spam
          weight: 30
        - name: WS invalid-json spam
          weight: 30
    hundredk:
      phases:
        # Create ~100,000 users over 600 seconds (~166/sec)
        - name: connect-100k
          duration: 600
          arrivalCount: 100000
        # Hold connections without adding more users
        - name: hold
          pause: 600
      # Only select the 100k scenario in this environment
      scenarios:
        - name: WS 100k connect-and-hold
          weight: 100

scenarios:
  - name: HTTP health flood
    flow:
      - loop:
          - get:
              url: "/api/health"
          - think: 0.2
        count: 20

  - name: WS debug-status spam
    engine: ws
    flow:
      - connect: "{{ ws_url }}"
      - loop:
          - send:
              type: text
              data: '{"type":"debug-status"}'
          - think: 0.02
        count: 100
      - close: true

  - name: WS invalid-json spam
    engine: ws
    flow:
      - connect: "{{ ws_url }}"
      - loop:
          - send: "not-json"
          - think: 0.02
        count: 50
      - close: true

  - name: WS 100k connect-and-hold
    engine: ws
    flow:
      - connect: "{{ ws_url }}"
      - send:
          type: text
          data: '{"type":"debug-status"}'
      - think: 600
      - close: true